Config/DataProcessors/ЗаполнениеКодовSKUНоменклатурыПрейскуранта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеКодовSKUНоменклатурыПрейскуранта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначатьКодыSKUГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/КодыТоваровSKU.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровSKU</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскурант</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/Прейскурант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Прейскурант</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСтатьяАналитикиОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиАналитикиОплатыЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятаСПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыДоговораПлатежногоАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыДоговораПлатежногоАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьПриФормированииАктаОбОказанииУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТРУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможнаОплатаЭС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВоВторичнойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ЗаполнениеКодовSKUНоменклатурыПрейскуранта/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	
	ТаблицаНоменклатурыПрейскуранта.Загрузить(ПолучитьСписокТоваров());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазрешатьИзменятьСуществующиеSKUПриИзменении(Элемент)
	Если НЕ РазрешатьИзменятьСуществующиеКодыSKU Тогда
		СнятьПометкиСоСтрокСSKU();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НазначатьКодыSKUГруппамПриИзменении(Элемент)
	НазначатьКодыSKUГруппамПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПометки(Команда)
	ИзменитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	ИзменитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	ИзменитьПометки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиВсемБезSKU(Команда)
	ИзменитьПометки(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодыSKU(Команда)
	СформироватьSKU();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокТоваров()
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Прейскурант.Ссылка КАК Номенклатура,
		               |	КодыТоваровSKU.SKU КАК SKU
		               |ИЗ
		               |	Справочник.Прейскурант КАК Прейскурант
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		               |		ПО Прейскурант.Ссылка = КодыТоваровSKU.Номенклатура
		               |ГДЕ
		               |	Прейскурант.ЭтоГруппа = ЛОЖЬ
		               |	И Прейскурант.ПометкаУдаления = ЛОЖЬ
		               |	И Прейскурант.Организация = &Организация
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	SKU,
		               |	Номенклатура";
	
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		               |	КодыТоваровSKU.SKU КАК SKU,
		               |	Прейскурант.Ссылка КАК Номенклатура
		               |ИЗ
		               |	Справочник.Прейскурант КАК Прейскурант
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		               |		ПО Прейскурант.Ссылка = КодыТоваровSKU.Номенклатура
		               |ГДЕ
		               |	Прейскурант.ЭтоГруппа = ЛОЖЬ
		               |	И Прейскурант.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Номенклатура,
		               |	SKU";
	КонецЕсли;
	
	Если Объект.НазначатьКодыSKUГруппам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Прейскурант.ЭтоГруппа = ЛОЖЬ", "ИСТИНА");	
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТоваров;
	
КонецФункции

&НаСервере
Процедура ИзменитьПометки(Пометка = Неопределено, ТолькоБезSKU = Ложь)

	Для каждого ТекСтр Из ТаблицаНоменклатурыПрейскуранта Цикл
		
		НовоеЗначениеПометки = ?(Пометка = Неопределено, Не ТекСтр.Пометка, Пометка);
		
		Если НовоеЗначениеПометки = Истина Тогда
			Если (ТолькоБезSKU ИЛИ НЕ РазрешатьИзменятьСуществующиеКодыSKU) И ЗначениеЗаполнено(ТекСтр.SKU) Тогда
				НовоеЗначениеПометки = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ТекСтр.Пометка = НовоеЗначениеПометки;
	
	КонецЦикла;

КонецПроцедуры // ИзменитьПометки()

&НаСервере
Процедура СнятьПометкиСоСтрокСSKU()

	Для каждого ТекСтр Из ТаблицаНоменклатурыПрейскуранта Цикл
		
		Если ЗначениеЗаполнено(ТекСтр.SKU) Тогда
			ТекСтр.Пометка = Ложь;
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СформироватьSKU(ТолькоПустые = Ложь)
	НовыйSKU = Неопределено;
	
	Для каждого ТекСтр Из ТаблицаНоменклатурыПрейскуранта Цикл
	
		Если ТекСтр.Пометка И (НЕ ТолькоПустые ИЛИ ПустаяСтрока(ТекСтр.SKU)) Тогда
			Организация = ТекСтр.Номенклатура.Организация;
			Номенклатура = ТекСтр.Номенклатура;
			
			Набор = РегистрыСведений.КодыТоваровSKU.СоздатьНаборЗаписей();
			
			Набор.Отбор.Организация.Значение = Организация;
			Набор.Отбор.Организация.Использование = Истина;
			Набор.Отбор.Номенклатура.Значение = Номенклатура;
			Набор.Отбор.Номенклатура.Использование = Истина;
			
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.Организация = ТекСтр.Номенклатура.Организация;
			НоваяЗапись.Номенклатура = ТекСтр.Номенклатура;
			Если НовыйSKU = Неопределено Тогда
				НовыйSKU = РегистрыСведений.КодыТоваровSKU.НовыйКодSKU(Организация);
			Иначе
				НовыйSKU = НовыйSKU + 1;
			КонецЕсли;
			НоваяЗапись.SKU = НовыйSKU;
			
			Набор.Записать();
			
			ТекСтр.SKU = НовыйSKU;
		КонецЕсли;
	
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ТаблицаНоменклатурыПрейскуранта.Загрузить(ПолучитьСписокТоваров());
КонецПроцедуры

&НаСервере
Процедура НазначатьКодыSKUГруппамПриИзмененииНаСервере()
	ТаблицаНоменклатурыПрейскуранта.Загрузить(ПолучитьСписокТоваров());
КонецПроцедуры

#КонецОбласти
